[
    {
        "id": "TKS-DP-001",
        "judul-soal": "Pancang yang Mengubah Segalanya",
        "soal": "Di sebuah pagi yang tampak biasa di Tegalrejo, sekelompok pekerja yang dikawal pejabat Belanda datang membawa kayu-kayu panjang. Tanpa banyak bicara, mereka mulai menanamkan pancang-pancang itu di tanah milik seorang pangeran Jawa yang sangat menjunjung tinggi warisan leluhurnya. Tanah itu bukan sekadar lahan, melainkan simbol kehormatan keluarga dan tempat ia merasa dilindungi. Melihat tanah keluarganya diperlakukan seolah hanya ruang proyek, sang pangeran merasa haknya diinjak dan martabatnya direndahkan. Dari tindakan yang tampak sederhana inilah, kemarahan lama yang terpendam terhadap campur tangan Belanda akhirnya meledak dan berubah menjadi perang panjang. Kejadian apa yang dimaksud dalam kisah ini?",
        "kunci-jawaban": "Pemasangan pancang jalan di tanah Diponegoro oleh Belanda.",
        "penjelasan": "Perang Diponegoro berawal dari pemasangan pancang untuk pembangunan jalan oleh Belanda di atas tanah milik Pangeran Diponegoro di Tegalrejo, sebuah tindakan yang dianggap merendahkan martabat dan mengabaikan hak pemilik tanah. Dari sudut pandang masa kini, peristiwa ini mengingatkan kita bahwa kebijakan pembangunan yang mengabaikan keadilan, hak rakyat kecil, dan dialog yang adil dapat memicu konflik sosial. Kita belajar bahwa penghormatan terhadap hak atas tanah, musyawarah, dan kepekaan terhadap nilai-nilai lokal sangat penting dalam membangun masyarakat yang damai.",
        "clue": "Penyebab awal meletusnya Perang Diponegoro.",
        "kata-kunci": ["pemasangan", "pancang", "jalan", "tanah", "diponegoro", "belanda"]
    },
    {
        "id": "TKS-DP-002",
        "judul-soal": "Api di Tegalrejo",
        "soal": "Siang itu, langit Tegalrejo yang biasanya diselimuti asap dapur dan suara anak-anak bermain berubah menjadi gelap oleh asap kebakaran. Pasukan berseragam datang dari berbagai arah, membawa senjata dan meriam kecil, mengepung kediaman seorang pangeran yang selama ini berani menyampaikan ketidakpuasannya pada kekuasaan Belanda. Rumah-rumah penduduk yang tak bersalah ikut terbakar, ternak berlarian, dan jerit tangis memenuhi udara. Dalam kekacauan itu, sang pangeran memilih mundur, meninggalkan kampung yang selama ini ia sebut rumah untuk menyusun perlawanan di tempat yang lebih aman. Peristiwa tragis inilah yang mengubah sebuah desa tenang menjadi simbol awal perlawanan besar di tanah Jawa. Peristiwa apa yang dimaksud?",
        "kunci-jawaban": "Penyerangan dan pembakaran Tegalrejo pada 21 Juli 1825.",
        "penjelasan": "Penyerangan dan pembakaran Tegalrejo oleh Belanda memaksa Diponegoro meninggalkan kediamannya dan beralih pada perang gerilya, menjadikan perlawanan rakyat semakin meluas dan intens. Bagi kita sekarang, peristiwa ini mengajarkan bahwa kekerasan dan tindakan represif untuk membungkam suara protes justru dapat memperkuat semangat perlawanan. Kita belajar pentingnya menyelesaikan konflik melalui dialog, keadilan, dan penghormatan terhadap suara kritis, bukan dengan intimidasi dan kekerasan.",
        "clue": "Penyerangan desa kediaman Diponegoro yang memicu perang gerilya.",
        "kata-kunci": ["penyerangan", "pembakaran", "tegalrejo", "diponegoro"]
    },
    {
        "id": "TKS-DP-003",
        "judul-soal": "Markas di Balik Gua Batu",
        "soal": "Setelah desanya tinggal puing dan bara, sang pangeran memilih tidak menyerah. Ia meninggalkan keramaian dan berjalan menuju daerah berbukit yang jauh dari jangkauan pengawasan Belanda. Di sana, di antara pepohonan dan tebing kapur, terdapat gua-gua yang tersembunyi dan sulit dijangkau. Tempat itulah yang ia jadikan rumah baru: bukan lagi istana megah, melainkan lorong-lorong batu yang menjadi ruang rapat, tempat berdoa, dan pusat pengaturan strategi. Dari tempat sunyi ini, ia mengumpulkan rakyat yang setia, melatih pasukan, dan menyusun serangan terhadap penjajah yang telah menghancurkan kampung halamannya. Nama tempat yang menjadi markas gerilya ini kemudian sangat lekat dengan kisah perlawanan sang pangeran. Markas apakah yang dimaksud?",
        "kunci-jawaban": "Selarong.",
        "penjelasan": "Selarong, sebuah daerah berkontur bukit dengan gua-gua batu, dijadikan Diponegoro sebagai markas perlawanan setelah Tegalrejo dihancurkan. Dari Selarong, strategi gerilya disusun dan perlawanan rakyat diorganisasi. Di masa kini, Selarong melambangkan bagaimana keterbatasan bukan alasan untuk berhenti berjuang: ruang sederhana bisa menjadi pusat gerakan besar ketika ada tekad dan solidaritas. Kita belajar bahwa perubahan sering dimulai dari tempat yang tidak mewah, tetapi dari keberanian dan kemampuan beradaptasi.",
        "clue": "Daerah berbukit dengan gua yang jadi markas Diponegoro.",
        "kata-kunci": ["selarong", "markas", "gua", "diponegoro"]
    },
    {
        "id": "TKS-DP-004",
        "judul-soal": "Serangan dari Tiga Arah",
        "soal": "Setelah cukup lama bertahan di daerah terpencil, sang pangeran memutuskan bahwa saatnya bukan hanya menghindar, tetapi juga mengguncang pusat kekuasaan musuh. Ia menyusun rencana serangan ke sebuah kota yang menjadi jantung pemerintahan Belanda di wilayah itu. Bukannya menyerang dari satu sisi, ia mengatur pasukannya untuk datang dari timur, barat, dan selatan secara hampir bersamaan. Saat fajar menyingsing, pasukan kolonial yang biasanya merasa aman di jalan-jalan kota tiba-tiba dikejutkan oleh serangan dari berbagai penjuru. Kota yang sebelumnya tampak tenang mendadak berubah menjadi medan pertempuran. Peristiwa ini menunjukkan bahwa perlawanan yang terorganisir mampu membuat kekuatan besar sekalipun kelabakan. Kejadian apa yang digambarkan dalam kisah ini?",
        "kunci-jawaban": "Penyerbuan Yogyakarta oleh Diponegoro pada 7 Agustus 1825.",
        "penjelasan": "Penyerbuan terhadap kota Yogyakarta dari beberapa arah oleh pasukan Diponegoro menunjukkan bahwa perlawanan yang terencana dapat menggoyahkan kekuatan kolonial di pusat kekuasaannya sendiri. Di masa sekarang, peristiwa ini mengingatkan kita bahwa perubahan membutuhkan strategi, koordinasi, dan kerja sama lintas lini, bukan hanya keberanian spontan. Kita belajar pentingnya perencanaan, kolaborasi, dan kemampuan membaca situasi dalam memperjuangkan keadilan.",
        "clue": "Serangan besar Diponegoro ke kota pusat kekuasaan Belanda di Jawa.",
        "kata-kunci": ["penyerbuan", "yogyakarta", "diponegoro"]
    },
    {
        "id": "TKS-DP-005",
        "judul-soal": "Harga di Atas Kepala Sang Pangeran",
        "soal": "Tahun demi tahun berlalu, namun usaha pasukan kolonial untuk menangkap seorang pangeran Jawa yang memimpin perlawanan tak kunjung berhasil. Ia berpindah dari satu tempat ke tempat lain, dibantu oleh rakyat yang masih setia menyembunyikan dan melindunginya. Di sisi lain, para pejabat kolonial merasa wibawa mereka runtuh karena tak mampu mengakhiri perang yang menguras biaya dan tenaga. Akhirnya, seorang jenderal Belanda mengumumkan sesuatu yang mencengangkan: siapa pun yang bisa menyerahkan sang pemimpin perlawanan, hidup atau mati, akan mendapat hadiah uang dalam jumlah yang sangat besar untuk ukuran masa itu. Pengumuman ini disebarkan dengan harapan ada yang tergoda untuk berkhianat demi imbalan. Peristiwa apa yang dimaksud?",
        "kunci-jawaban": "Pengumuman hadiah 20.000 gulden oleh Jenderal de Kock.",
        "penjelasan": "Ketika Perang Diponegoro berlarut-larut, Jenderal de Kock mengumumkan hadiah 20.000 gulden bagi siapa saja yang dapat membantu menangkap Diponegoro. Langkah ini memperlihatkan bagaimana kekuasaan kolonial berusaha memakai uang dan iming-iming materi untuk memecah kesetiaan rakyat. Di masa sekarang, kita diingatkan bahwa integritas dan kesetiaan terhadap nilai kebenaran sering diuji oleh godaan keuntungan sesaat. Kita belajar pentingnya menolak pengkhianatan, suap, dan kompromi yang merugikan kepentingan bersama demi kepentingan pribadi.",
        "clue": "Sayembara besar untuk menangkap Diponegoro.",
        "kata-kunci": ["pengumuman", "hadiah", "20000 gulden", "de kock"]
    },

    {
        "id": "TKS-AC-001",
        "judul-soal": "Surat yang Menantang Martabat",
        "soal": "Di ujung barat Nusantara, sebuah kerajaan yang terkenal keras kepala terhadap penjajah menerima kunjungan utusan dari negeri jauh. Utusan itu tidak datang membawa persahabatan, melainkan sebuah surat tebal berisi tuntutan: kerajaan diminta mengakui bahwa kekuasaan Belanda berada di atas kedaulatannya. Bagi sebagian orang, menandatangani mungkin tampak sebagai jalan aman untuk menghindari perang. Namun bagi para pemimpin kerajaan, permintaan itu terasa seperti menghapus kehormatan dan identitas mereka sebagai negeri merdeka. Jawaban yang dikirim bukan berupa setuju, melainkan penolakan yang tegas. Hanya beberapa hari kemudian, pihak yang merasa direndahkan itu justru berbalik menyatakan bahwa hubungan damai sudah berakhir dan memilih jalan kekerasan. Keputusan besar apakah yang diambil Belanda setelah penolakan itu?",
        "kunci-jawaban": "Deklarasi perang Belanda terhadap Aceh pada 28 Maret 1873.",
        "penjelasan": "Penolakan Kesultanan Aceh terhadap ultimatum Belanda untuk mengakui kedaulatan kolonial dibalas dengan pernyataan perang resmi pada 28 Maret 1873. Dari sinilah Perang Aceh yang panjang dimulai. Bagi masa kini, peristiwa ini mengingatkan kita bahwa kedaulatan suatu bangsa tidak boleh dianggap remeh, dan tekanan sepihak justru dapat memicu perlawanan. Kita belajar bahwa dalam hubungan antarnegara maupun antarkelompok, penghormatan dan dialog yang setara jauh lebih bijak daripada ancaman dan pemaksaan.",
        "clue": "Awal resmi meletusnya Perang Aceh setelah penolakan ultimatum.",
        "kata-kunci": ["deklarasi", "perang", "belanda", "aceh"]
    },
    {
        "id": "TKS-AC-002",
        "judul-soal": "Di Bawah Bayang Kubah Masjid",
        "soal": "Di sebuah kota pesisir yang menjadi pintu masuk ke sebuah kerajaan di utara Sumatra, berdiri sebuah masjid besar dengan kubah yang menjadi kebanggaan rakyat. Saat pasukan asing datang menyerbu, masjid ini tidak hanya menjadi tempat beribadah, tetapi juga simbol kehormatan dan titik kumpul perlawanan. Tembakan dilontarkan, pekikan takbir bersahutan, dan halaman masjid berubah menjadi arena pertempuran sengit. Seorang perwira tinggi dari pihak penyerang memimpin langsung upaya untuk menaklukkan kota itu. Namun di tengah kekacauan, justru ia yang roboh terkena tembakan, membuat kabar kematiannya menggema sebagai pesan bahwa tempat suci tidak akan mudah ditaklukkan. Peristiwa apakah yang sedang diceritakan?",
        "kunci-jawaban": "Tewasnya Jenderal Kohler di halaman Masjid Raya Kutaraja pada 14 April 1873.",
        "penjelasan": "Dalam agresi militer pertama ke Aceh, Jenderal Kohler memimpin serangan ke Kutaraja dan berupaya menguasai Masjid Raya. Ia justru tewas di halaman masjid tersebut, menjadi lambang bahwa penindasan terhadap tempat suci dan keyakinan rakyat tidak akan berjalan mulus. Di masa kini, peristiwa ini mengingatkan kita bahwa kekerasan terhadap simbol-simbol identitas dan keagamaan sering kali justru memperkuat perlawanan. Kita belajar pentingnya menghormati ruang ibadah dan keyakinan orang lain, serta menghindari penggunaan kekerasan untuk menundukkan kepercayaan.",
        "clue": "Kematian seorang jenderal Belanda di halaman masjid raya Aceh.",
        "kata-kunci": ["tewasnya", "jenderal kohler", "masjid raya", "kutaraja"]
    },
    {
        "id": "TKS-AC-003",
        "judul-soal": "Di Antara Kepungan dan Wabah",
        "soal": "Bayangkan sebuah istana yang dikelilingi ancaman dari dua arah sekaligus: di luar tembok, meriam musuh mengarah siap menembak; di dalam, penyakit yang tidak terlihat berkeliaran dari satu tubuh ke tubuh lain. Di tengah situasi itu, sosok yang diharapkan menjadi pemersatu dan pemberi arah justru terbaring lemah. Ia bukan tumbang oleh peluru, melainkan oleh penyakit yang menyergap di tengah keterbatasan obat dan perawatan. Ketika kabar wafatnya menyebar, rakyat harus menerima kenyataan bahwa mereka kehilangan pemimpin formal di saat perang belum berakhir. Peristiwa apa yang digambarkan dalam kisah ini?",
        "kunci-jawaban": "Wafatnya Sultan Mahmud Syah pada 29 Januari 1874.",
        "penjelasan": "Sultan Mahmud Syah, pemimpin tertinggi Aceh, wafat akibat wabah penyakit di tengah agresi militer Belanda, sehingga Aceh kehilangan sosok sultan saat perang masih berlangsung. Peristiwa ini mengingatkan kita bahwa dalam krisis, ancaman tidak selalu datang dari musuh yang terlihat; bencana kesehatan dan kelemahan sistem layanan juga bisa memperparah keadaan. Di masa kini, kita belajar pentingnya kesiapsiagaan kesehatan, kepemimpinan yang kuat, dan sistem yang mampu bertahan dalam situasi darurat, agar masyarakat tidak mudah runtuh ketika menghadapi tekanan dari luar maupun dari dalam.",
        "clue": "Kematian sultan Aceh akibat penyakit saat agresi Belanda.",
        "kata-kunci": ["wafatnya", "sultan mahmud syah", "aceh"]
    },
    {
        "id": "TKS-AC-004",
        "judul-soal": "Ketika Perlawanan Menjadi Ibadah",
        "soal": "Di sebuah pedalaman di tanah rencong, seorang ulama yang disegani berdiri di hadapan barisan rakyat yang wajahnya lelah tetapi matanya masih menyimpan harapan. Mereka sudah lama menyaksikan bagaimana tanah mereka dipaksa tunduk, hasil bumi diperas, dan kehormatan mereka diremehkan. Sang ulama tidak menawarkan senjata baru atau janji kemenangan instan, melainkan mengajak mereka melihat perlawanan dari sudut pandang yang lebih dalam: bahwa mempertahankan tanah dan kehormatan dari penjajahan adalah bagian dari pengabdian kepada Tuhan. Seruan itu bukan hanya ajakan bertempur, melainkan juga ajakan untuk tetap memaknai perjuangan sebagai jalan hidup. Dari hari itu, perlawanan melawan penjajah tidak lagi dianggap sekadar konflik politik, tetapi juga perang yang memiliki dimensi spiritual. Peristiwa apakah ini?",
        "kunci-jawaban": "Seruan Perang Sabil oleh Teuku di Tiro Syeh Saman pada 1881.",
        "penjelasan": "Teuku di Tiro Syeh Saman mengobarkan Perang Sabil di Aceh, menjadikan perlawanan terhadap kolonialisme sebagai bagian dari panggilan iman dan kehormatan. Di masa kini, peristiwa ini mengingatkan kita bahwa nilai dan keyakinan dapat menjadi sumber kekuatan moral dalam melawan ketidakadilan, tetapi juga harus diiringi dengan kebijaksanaan agar tidak disalahgunakan. Kita belajar pentingnya menjadikan nilai spiritual sebagai dorongan untuk membela kemanusiaan, bukan untuk saling menindas.",
        "clue": "Seruan jihad di Aceh yang menguatkan perlawanan rakyat.",
        "kata-kunci": ["seruan", "perang sabil", "teuku di tiro", "saman"]
    },
    {
        "id": "TKS-AC-005",
        "judul-soal": "Siasat di Atas Gelombang Laut",
        "soal": "Seorang pemimpin perlawanan dari tanah Aceh terkenal bukan hanya karena keberaniannya, tetapi juga kecerdikannya membaca kelemahan lawan. Pada suatu kesempatan, ia dan orang-orangnya menaiki sebuah kapal milik pihak yang selama ini menjadi musuh di laut. Di mata sebagian orang, langkah ini tampak seperti tanda ia mulai bersikap lunak atau bahkan berpihak pada mereka. Namun ketika kapal sudah berada jauh di tengah laut dan kewaspadaan para awak mulai menurun, sang pemimpin menunjukkan maksud sebenarnya: ia dan pasukannya berbalik menguasai kapal, melumpuhkan awak, dan merampas senjata yang sebelumnya diarahkan kepada rakyatnya sendiri. Aksi dramatis ini membuat namanya semakin dikenal sebagai tokoh yang sulit ditebak. Peristiwa apa yang dimaksud?",
        "kunci-jawaban": "Teuku Umar menyerang awak kapal Bengkoelen dan merampas senjata pada 3 Juli 1884.",
        "penjelasan": "Teuku Umar menggunakan tipu daya dengan berpura-pura bekerja sama, lalu di tengah perjalanan justru menyerang kapal Bengkoelen dan merampas persenjataan Belanda untuk memperkuat perlawanan Aceh. Di zaman sekarang, kisah ini mengingatkan kita bahwa kecerdikan strategi dapat mengimbangi kekuatan material yang lebih besar. Namun, kita juga belajar bahwa taktik licik perlu diimbangi etika dan tujuan yang jelas agar tidak tergelincir menjadi pengkhianatan terhadap nilai kemanusiaan.",
        "clue": "Aksi Teuku Umar menguasai kapal dan merampas senjata Belanda.",
        "kata-kunci": ["teuku umar", "kapal bengkoelen", "merampas", "senjata"]
    },

    {
        "id": "TKS-AM-001",
        "judul-soal": "Janji Datang Menjemput, Ternyata Datang Menguasai",
        "soal": "Sesaat setelah perang besar dunia berakhir, sebuah kota kecil di Jawa Tengah menjadi tempat mendarat pasukan dari jauh yang mengatasnamakan diri sebagai pembawa perdamaian. Mereka mengatakan bahwa tugas utama mereka hanya menjemput tawanan dari penguasa sebelumnya dan mengurus pemulangan. Awalnya, rakyat dan pejuang republik mencoba memberi ruang dan melihat situasi. Namun perlahan-lahan, tanda-tanda yang muncul justru berbeda: orang-orang berseragam yang dulu dikenal sebagai tentara kolonial mulai dilepas dari kamp tawanan, diberi pakaian militer kembali, lalu dipersenjatai. Mereka kemudian bertindak seolah-olah tanah yang baru saja memproklamasikan kemerdekaan itu adalah milik lama yang boleh direbut kembali. Di titik inilah, rasa percaya berubah menjadi kemarahan dan perlawanan. Peristiwa apa yang digambarkan?",
        "kunci-jawaban": "Pengkhianatan Sekutu yang mempersenjatai kembali Belanda di Ambarawa.",
        "penjelasan": "Di Ambarawa, pasukan Sekutu yang awalnya datang dengan alasan menjemput tawanan justru membebaskan dan mempersenjatai kembali tentara Belanda/KNIL, memicu konflik dengan pejuang Indonesia. Bagi masa kini, peristiwa ini mengajarkan bahwa tidak semua janji atas nama \"misi damai\" benar-benar netral; sering ada kepentingan politik di baliknya. Kita belajar pentingnya kewaspadaan, kemampuan membaca situasi, dan memperjuangkan kedaulatan tanpa mudah tertipu oleh narasi yang tampak manis.",
        "clue": "Sekutu melanggar janji dan mengaktifkan kembali tentara Belanda di Ambarawa.",
        "kata-kunci": ["sekutu", "mempersenjatai", "belanda", "ambarawa"]
    },
    {
        "id": "TKS-AM-002",
        "judul-soal": "Benteng di Persimpangan Jalan",
        "soal": "Di sekitar sebuah kota penghubung antara pegunungan dan pesisir, terdapat benteng yang berdiri di dekat jalur kereta dan jalan utama. Selama pasukan asing menguasainya, benteng ini menjadi titik pengendali pergerakan logistik dan pasukan, seolah menjadi kunci pintu keluar-masuk wilayah tersebut. Pejuang republik menyadari bahwa selama benteng itu masih di tangan musuh, ancaman serangan dan tekanan akan terus membayangi desa-desa sekitar. Karena itu, mereka menyusun serangan keras: tembakan dari kejauhan, gerakan mendekat dalam gelap, hingga pertempuran jarak dekat yang menegangkan. Setelah perjuangan melelahkan, bendera dan lambang musuh akhirnya diturunkan dari dinding benteng, diganti dengan simbol kemerdekaan yang baru lahir. Peristiwa apa yang diceritakan di sini?",
        "kunci-jawaban": "Perebutan benteng sekitar Ambarawa oleh pasukan RI.",
        "penjelasan": "Perebutan benteng-benteng strategis di sekitar Ambarawa oleh pasukan Republik Indonesia mempersempit ruang gerak Sekutu dan Belanda, menjadi langkah penting sebelum pengepungan yang lebih besar. Di masa kini, peristiwa ini menunjukkan bahwa kemenangan besar sering lahir dari keberhasilan menguasai titik-titik strategis yang mungkin tampak kecil. Kita belajar pentingnya mengenali \"titik kunci\" dalam kehidupan—baik itu pendidikan, informasi, maupun kebijakan—yang jika dikuasai dapat mengubah arah masa depan.",
        "clue": "Pejuang republik merebut benteng strategis di sekitar Ambarawa.",
        "kata-kunci": ["perebutan", "benteng", "ambarawa", "pasukan ri"]
    },
    {
        "id": "TKS-AM-003",
        "judul-soal": "Pagar Hidup di Jalan Mundur Musuh",
        "soal": "Ketika pertempuran di sebuah kota kecil semakin memanas, para pemimpin pejuang menyadari bahwa musuh mungkin akan mencoba melarikan diri melalui jalan-jalan desa yang terbentang di sekitarnya. Senjata mereka terbatas, tetapi jumlah rakyat yang marah tidak. Maka, sebuah gagasan sederhana namun berani muncul: warga diminta berdiri di sepanjang jalur yang mungkin dilewati pasukan lawan, membentuk barisan padat seperti pagar hidup. Mereka bukan pasukan bersenjata lengkap, tetapi kehadiran mereka menutup ruang gerak dan membuat musuh kesulitan mencari jalan keluar. Dengan cara itu, rakyat biasa menjadi bagian langsung dari strategi mengepung kekuatan yang jauh lebih besar. Taktik apakah yang digambarkan dalam kisah ini?",
        "kunci-jawaban": "Taktik pagar betis rakyat Ambarawa.",
        "penjelasan": "Dalam Palagan Ambarawa, rakyat turut membantu pasukan Republik dengan membuat \"pagar betis\", yakni barisan manusia yang menutup kemungkinan jalur mundur sekutu dan Belanda. Peristiwa ini menunjukkan kekuatan partisipasi rakyat biasa dalam perjuangan kolektif. Di masa kini, kita belajar bahwa perubahan sosial tidak hanya bergantung pada pemimpin dan pasukan resmi, tetapi juga pada keberanian warga untuk terlibat aktif menjaga ruang publik, menolak ketidakadilan, dan saling melindungi.",
        "clue": "Rakyat berdiri berbaris menutup jalan mundur pasukan lawan.",
        "kata-kunci": ["taktik", "pagar betis", "rakyat", "ambarawa"]
    },
    {
        "id": "TKS-AM-004",
        "judul-soal": "Kabut Pagi dan Serangan dari Ketinggian",
        "soal": "Pagi itu, kabut masih tebal menyelimuti perbukitan di sekitar sebuah kota yang sedang diperebutkan. Di balik tirai kabut itu, pasukan republik bergerak senyap, mendaki lereng-lereng yang pernah mereka jelajahi sebagai rakyat biasa. Kini, bukit dan tebing itu berubah fungsi menjadi posisi tembak yang menguntungkan. Dari empat penjuru wilayah tinggi, mereka menyiapkan senjata untuk menembak ke arah posisi musuh yang berada di dataran lebih rendah. Ketika tembakan pertama dilepaskan secara hampir bersamaan, pasukan lawan yang semula merasa aman di bawah tiba-tiba panik dan kesulitan membalas. Serangan dari ketinggian ini perlahan memaksa mereka mundur, meninggalkan kota yang tadinya mereka kuasai. Peristiwa apakah yang digambarkan?",
        "kunci-jawaban": "Serangan serentak TKR dari bukit sekitar Ambarawa.",
        "penjelasan": "Serangan serentak dari bukit-bukit di sekitar Ambarawa yang dipimpin pasukan TKR di bawah komando Sudirman membuat posisi musuh terdesak dan menjadi faktor kemenangan Republik di Palagan Ambarawa. Bagi masa kini, kisah ini mengingatkan bahwa membaca kondisi lapangan dan memanfaatkan keunggulan posisi merupakan kunci strategi yang baik, bukan hanya mengandalkan keberanian. Kita belajar pentingnya persiapan, pengetahuan, dan kreativitas dalam menghadapi tantangan yang terlihat lebih besar dari kemampuan kita.",
        "clue": "Serangan pejuang dari bukit-bukit mengelilingi Ambarawa.",
        "kata-kunci": ["serangan", "serentak", "tkr", "bukit", "ambarawa"]
    },
    {
        "id": "TKS-AM-005",
        "judul-soal": "Pemimpin Muda di Tengah Pengepungan",
        "soal": "Di tengah situasi yang serba tidak pasti, dengan pasukan yang persenjataannya tidak sebanding dengan musuh, muncul seorang pemimpin yang usianya belum terlalu tua untuk ukuran seorang komandan perang. Ia lebih sering terlihat bersama pasukannya di medan, bukan hanya duduk di meja perundingan. Dari pos-pos sederhana di sekitar kota yang dikepung, ia mengatur agar jalur suplai musuh diputus, dan pergerakan mereka dipantau terus-menerus. Pelan tapi pasti, strategi pengepungan itu memaksa pasukan lawan meninggalkan kota yang tadinya mereka pegang kuat dan mundur ke daerah lain. Pemimpin muda ini kelak dikenal sebagai salah satu tokoh penting dalam sejarah militer Indonesia. Siapakah dan peristiwa apa yang tersirat dalam kisah ini?",
        "kunci-jawaban": "Kolonel Sudirman dalam kemenangan Palagan Ambarawa.",
        "penjelasan": "Kolonel Sudirman memimpin langsung strategi pengepungan di Ambarawa dan berhasil memaksa Sekutu mundur, menjadikan Palagan Ambarawa sebagai salah satu kemenangan penting RI setelah proklamasi. Di masa kini, peristiwa ini mengajarkan bahwa kepemimpinan tidak selalu ditentukan oleh usia atau fasilitas, tetapi oleh keberanian, kedekatan dengan rakyat, dan kemampuan mengambil keputusan bijak. Kita belajar pentingnya pemimpin yang mau turun ke lapangan, mendengar, dan memimpin dengan teladan.",
        "clue": "Pemimpin muda yang memimpin kemenangan di Palagan Ambarawa.",
        "kata-kunci": ["kolonel sudirman", "kemenangan", "palagan ambarawa"]
    },

    {
        "id": "TKS-SU-001",
        "judul-soal": "Malam Sebelum Kota Direbut Kembali",
        "soal": "Pada suatu malam di akhir masa pendudukan, sebuah kota yang dulu pernah menjadi pusat pemerintahan republik tampak sunyi di permukaan. Namun di balik tembok rumah-rumah, di sudut gang, dan di bangunan yang tampak biasa, para pejuang mulai memasuki kota satu per satu. Mereka datang bukan dengan konvoi besar, tetapi dengan langkah-langkah kecil yang nyaris tak terdengar. Beberapa di antara mereka bersembunyi di parit, sebagian lain menunggu di balik pintu dan jendela, menahan dingin dan rasa cemas. Mereka semua menunggu saat fajar, ketika perintah menyerang akan diberikan untuk menunjukkan bahwa kota itu belum sepenuhnya milik penjajah. Persiapan senyap yang mengubah kota menjadi panggung serangan inilah yang menjadi awal dari peristiwa besar keesokan harinya. Persiapan apakah yang sedang berlangsung?",
        "kunci-jawaban": "Persiapan Serangan Umum 1 Maret 1949.",
        "penjelasan": "Menjelang serangan besar di awal Maret 1949, pasukan republik secara diam-diam memasuki dan menempati posisi strategis di Yogyakarta, ibu kota republik yang diduduki Belanda. Persiapan ini memungkinkan operasi militer dilakukan secara serentak dan terkoordinasi. Bagi masa kini, peristiwa ini mengingatkan bahwa langkah besar sering didahului oleh persiapan yang tidak terlihat. Kita belajar pentingnya ketekunan, kerja di balik layar, dan kemampuan bekerjasama dalam diam untuk mewujudkan tujuan bersama.",
        "clue": "Pejuang masuk diam-diam ke Yogyakarta sebelum serangan besar.",
        "kata-kunci": ["persiapan", "serangan umum", "1 maret 1949", "yogyakarta"]
    },
    {
        "id": "TKS-SU-002",
        "judul-soal": "Enam Jam yang Mengubah Pandangan Dunia",
        "soal": "Pagi itu, kota yang pernah menjadi ibu kota republik tampak seperti biasa: dijaga ketat oleh serdadu asing yang merasa telah menguasai segalanya. Namun, setelah matahari naik sedikit, suasana tiba-tiba berubah. Dari berbagai sudut kota—utara, selatan, timur, dan barat—suara tembakan meletus hampir bersamaan. Pasukan yang selama ini bergerilya keluar dari tempat persembunyian dan mulai menguasai pos-pos penting. Bendera yang melambangkan kemerdekaan kembali berkibar di beberapa titik strategis. Meski hanya berlangsung sekitar enam jam, momen ketika kota itu kembali berada di bawah kendali pejuang memberi pesan kuat: bahwa republik belum mati. Peristiwa apakah yang dimaksud dalam kisah ini?",
        "kunci-jawaban": "Serangan Umum 1 Maret 1949.",
        "penjelasan": "Serangan besar yang dilancarkan pasukan republik pada 1 Maret 1949 berhasil menguasai Yogyakarta selama beberapa jam dan membuktikan bahwa Indonesia masih memiliki kekuatan militer yang terorganisir. Di zaman sekarang, peristiwa ini mengajarkan bahwa durasi kemenangan tidak selalu menentukan besarnya dampak; kadang, momen singkat yang direncanakan dengan baik dapat mengubah cara dunia memandang suatu perjuangan. Kita belajar bahwa konsistensi dan simbol keberhasilan sangat penting untuk menjaga harapan dan legitimasi.",
        "clue": "Operasi militer yang membuat Yogyakarta dikuasai pejuang selama sekitar enam jam.",
        "kata-kunci": ["serangan umum", "1 maret 1949", "yogyakarta", "6 jam"]
    },
    {
        "id": "TKS-SU-003",
        "judul-soal": "Pesan dari Kota untuk Panglima di Hutan",
        "soal": "Di tengah hutan dan pegunungan, seorang panglima besar memimpin perang gerilya jauh dari kota yang pernah ia bela. Ia hidup berpindah-pindah bersama pasukannya, menghindari kepungan dan terus menjaga semangat juang. Suatu hari, seorang kurir datang membawa kabar yang berbeda dari biasanya: bukan tentang kekalahan, bukan tentang penangkapan, melainkan tentang sebuah kota yang berhasil dikuasai kembali, meski hanya dalam hitungan jam. Kota itu adalah ibu kota republik yang selama ini menjadi simbol perjuangan. Kabar itu membuat beban di dada sang panglima sedikit terangkat; perjuangan yang ia pimpin dari kejauhan ternyata masih berbuah nyata di medan lain. Kabar apakah yang dibawa kurir tersebut?",
        "kunci-jawaban": "Kabar keberhasilan disampaikan kepada Jenderal Soedirman.",
        "penjelasan": "Setelah kota yang diduduki berhasil direbut sementara oleh pasukan republik, kabar keberhasilan itu dikirimkan kepada Jenderal Soedirman yang sedang bergerilya di pedalaman. Informasi ini memulihkan keyakinan bahwa perjuangan bersenjata belum sia-sia. Di masa kini, kita diingatkan bahwa pemimpin dan pejuang di garis depan membutuhkan kabar baik dan dukungan moral untuk terus bertahan. Kita belajar pentingnya komunikasi yang jujur, saling menguatkan, serta menyebarkan harapan di tengah situasi sulit.",
        "clue": "Kabar keberhasilan merebut kembali ibu kota republik yang disampaikan kepada panglima gerilya.",
        "kata-kunci": ["kabar keberhasilan", "jenderal soedirman", "gerilya"]
    },
    {
        "id": "TKS-SU-004",
        "judul-soal": "Suara Kecil di Radio yang Terdengar Jauh",
        "soal": "Di sebuah ruangan sederhana yang tersembunyi, seorang penyiar duduk di depan mikrofon tua. Di hadapannya, tidak ada penonton yang bersorak, hanya perangkat radio yang tampak usang namun masih setia menyala. Ia membaca naskah pendek tentang sebuah kota yang baru saja berhasil dikuasai kembali oleh pejuang republik untuk beberapa jam. Mungkin suaranya tidak terdengar di medan perang, tetapi gelombang radio yang ia pancarkan bisa menembus batas wilayah dan mencapai telinga orang-orang di tempat lain, bahkan di luar negeri. Bagi mereka yang mendengarkan, siaran itu menjadi bukti hidup bahwa republik masih bergerak dan belum menyerah. Peristiwa apa yang digambarkan dalam cerita ini?",
        "kunci-jawaban": "Siaran radio Serangan Umum 1 Maret.",
        "penjelasan": "Radio AURI menyiarkan keberhasilan serangan terhadap kota yang diduduki ke berbagai penjuru, mengabarkan bahwa pasukan republik masih aktif dan mampu mengguncang kekuasaan Belanda. Dalam konteks masa kini, peristiwa ini menunjukkan betapa pentingnya media dan informasi yang jujur untuk membentuk opini publik dan dukungan internasional. Kita belajar bahwa menyebarkan kebenaran, data yang akurat, dan suara korban ketidakadilan adalah bagian penting dari perjuangan.",
        "clue": "Siaran tentang keberhasilan pejuang merebut kota yang diduduki penjajah.",
        "kata-kunci": ["siaran radio", "auri", "serangan umum", "1 maret"]
    },
    {
        "id": "TKS-SU-005",
        "judul-soal": "Ketika Pertempuran Menjadi Pesan Politik",
        "soal": "Bagi sebagian orang, pertempuran yang hanya menguasai sebuah kota selama beberapa jam mungkin tampak sebagai kemenangan kecil yang segera berlalu. Namun bagi para pemimpin republik, operasi itu dirancang dengan tujuan yang lebih besar daripada sekadar mengusir musuh untuk sementara. Mereka tahu bahwa musuh sedang berusaha meyakinkan dunia bahwa republik sudah hancur, bahwa perlawanan tinggal sisa-sisa kecil tanpa kekuatan. Dengan menunjukkan bahwa pasukan mereka masih mampu mengkoordinasikan serangan, menguasai ibu kota, dan kemudian menyebarkan kabar itu ke luar negeri, mereka mengubah pertempuran menjadi pesan yang menantang klaim lawan. Peristiwa apakah yang menjadikan pertempuran militer ini sebagai strategi diplomatik?",
        "kunci-jawaban": "Tujuan politis Serangan Umum 1 Maret.",
        "penjelasan": "Serangan terhadap ibu kota republik yang diduduki tidak hanya bertujuan militer, tetapi juga dirancang untuk menunjukkan kepada dunia internasional bahwa Republik Indonesia masih eksis dan aktif melawan. Hal ini melemahkan propaganda Belanda dan memperkuat posisi Indonesia dalam perundingan. Di masa kini, peristiwa ini mengingatkan kita bahwa tindakan di lapangan dan komunikasi kepada publik harus saling mendukung. Kita belajar pentingnya strategi jangka panjang: bahwa perjuangan bukan hanya tentang menang hari ini, tetapi juga tentang membentuk masa depan melalui citra, kepercayaan, dan dukungan kolektif.",
        "clue": "Pertempuran singkat yang sengaja dijadikan bukti bahwa republik masih ada.",
        "kata-kunci": ["tujuan politis", "serangan umum 1 maret", "eksistensi republik"]
    }
]