[
    {
        "id": "TKS-DP-001",
        "judul-soal": "Pancang yang Mengubah Segalanya",
        "soal": "Pagi itu, suasana di Tegalrejo sebenarnya tenang seperti biasa. Namun ketenangan itu pecah ketika para pekerja Belanda datang membawa kayu-kayu panjang dan mulai menanamkan pancang-pancang di tanah milik seorang pangeran Jawa yang sangat menjunjung tinggi kehormatan leluhurnya. Tanah itu bukan sekadar lahan kosong, melainkan bagian dari wilayah yang ia anggap suci dan tidak boleh disentuh sembarangan. Tindakan Belanda yang seolah meremehkan hak dan martabatnya ini menjadi percikan awal yang menyalakan api kemarahan besar dan akhirnya berkembang menjadi perang panjang. Kejadian apa yang dimaksud?",
        "kunci-jawaban": "Pemasangan pancang jalan di tanah Diponegoro oleh Belanda.",
        "penjelasan": "Perang Diponegoro berawal ketika Belanda memerintahkan pemasangan pancang untuk pembangunan jalan yang melintasi tanah milik Pangeran Diponegoro di Tegalrejo. Tindakan sepihak ini dianggap sebagai penghinaan terhadap hak atas tanah dan martabat bangsawan Jawa, sehingga memicu kemarahan Diponegoro dan menjadi pemicu langsung meletusnya perang.",
        "clue": "Penyebab awal Perang Diponegoro.",
        "kata-kunci": ["pancang", "tanah", "diponegoro", "tegalrejo"]
    },
    {
        "id": "TKS-DP-002",
        "judul-soal": "Api di Tegalrejo",
        "soal": "Siang hari di Tegalrejo yang biasanya dipenuhi suara ayam dan anak-anak bermain, berubah menjadi lautan api dan asap. Pasukan Belanda datang dengan meriam dan senjata, mengepung kediaman sang pangeran dari berbagai arah. Rumah-rumah penduduk ikut terbakar, jeritan dan kepanikan terdengar di mana-mana. Di tengah kekacauan itu, sang pangeran berhasil meloloskan diri, meninggalkan kampung halamannya yang hangus. Peristiwa tragis ini kemudian dikenang sebagai titik balik yang mengubah Tegalrejo dari sebuah desa tenang menjadi simbol awal perlawanan besar. Apa yang terjadi hari itu?",
        "kunci-jawaban": "Penyerangan dan pembakaran Tegalrejo pada 21 Juli 1825.",
        "penjelasan": "Pada 21 Juli 1825, Belanda melancarkan serangan besar ke Tegalrejo, kediaman Diponegoro, dengan tujuan menangkapnya. Serangan ini diiringi pembakaran rumah-rumah dan penghancuran desa, memaksa Diponegoro melarikan diri ke Selarong. Peristiwa ini menandai dimulainya perang gerilya yang lebih luas dan terorganisir.",
        "clue": "Peristiwa yang membuat Diponegoro pindah ke Selarong.",
        "kata-kunci": ["penyerangan", "pembakaran", "tegalrejo", "21 juli 1825"]
    },
    {
        "id": "TKS-DP-003",
        "judul-soal": "Markas Baru di Kaki Bukit",
        "soal": "Setelah Tegalrejo tinggal puing dan bara, sang pangeran tidak menyerah. Ia menyingkir jauh dari keramaian, menyusuri jalan setapak hingga sampai di sebuah lembah sunyi di kaki bukit kapur. Di sana terdapat gua-gua batu yang tersembunyi di antara pepohonan lebat, seolah alam menyediakan benteng alami untuknya. Di tempat inilah ia menyusun ulang kekuatan, mengumpulkan pengikut, dan melatih pasukan untuk melanjutkan perlawanan terhadap Belanda. Markas apakah yang menjadi saksi lahirnya strategi-strategi gerilya ini?",
        "kunci-jawaban": "Selarong.",
        "penjelasan": "Setelah pelariannya dari Tegalrejo, Diponegoro menjadikan Selarong yang terletak di daerah berbukit sebagai markas gerilyanya. Gua-gua dan medan yang sulit dijangkau di Selarong dimanfaatkan sebagai tempat berlindung, mengatur strategi, serta mengorganisasi pasukan untuk meneruskan perlawanan terhadap Belanda.",
        "clue": "Markas Diponegoro yang berupa gua.",
        "kata-kunci": ["selarong", "markas", "diponegoro"]
    },
    {
        "id": "TKS-DP-004",
        "judul-soal": "Serangan Besar dari Tiga Penjuru",
        "soal": "Beberapa waktu setelah berpindah markas, sang pangeran tidak hanya bertahan, tetapi mulai menyerang balik. Ia menyusun rencana serangan besar ke kota yang menjadi pusat kekuasaan kolonial di wilayah itu. Tiga pasukan disiapkan dengan cermat: satu bergerak dari timur, satu dari barat, dan satu lagi dari selatan. Di pagi buta, ketika penduduk kota belum sepenuhnya sadar, pasukan-pasukan ini serentak menghantam, membuat kota gempar dan pasukan Belanda kewalahan. Inilah salah satu momen ketika kota yang mereka kuasai seakan diambil alih oleh gelombang perlawanan rakyat. Kejadian apa yang dimaksud?",
        "kunci-jawaban": "Penyerbuan Yogyakarta oleh Diponegoro pada 7 Agustus 1825.",
        "penjelasan": "Pada 7 Agustus 1825, Diponegoro melancarkan serangan besar ke Yogyakarta dengan tiga pasukan yang menyerang dari berbagai arah. Serangan ini mengguncang posisi Belanda di kota dan menunjukkan bahwa kekuatan Diponegoro bukan sekadar perlawanan kecil, melainkan gerakan militer yang terorganisir.",
        "clue": "Serangan besar pertama Diponegoro.",
        "kata-kunci": ["penyerbuan", "yogyakarta", "7 agustus 1825"]
    },
    {
        "id": "TKS-DP-005",
        "judul-soal": "Hadiah untuk Kepala Sang Pangeran",
        "soal": "Tahun-tahun berlalu, tetapi upaya Belanda untuk menangkap sang pangeran selalu berujung kegagalan. Ia terus berpindah, memimpin pasukan, dan mendapat dukungan rakyat di berbagai daerah. Merasa semakin terdesak dan malu karena tidak kunjung berhasil, seorang jenderal Belanda akhirnya mengambil langkah yang tidak biasa: ia mengumumkan hadiah dalam jumlah sangat besar bagi siapa pun, baik bangsawan maupun rakyat biasa, yang bisa membantu menangkap sang pemimpin pemberontakan, hidup ataupun mati. Pengumuman ini disebar untuk menggoyahkan kesetiaan rakyat. Peristiwa apa ini?",
        "kunci-jawaban": "Pengumuman hadiah 20.000 gulden oleh Jenderal de Kock.",
        "penjelasan": "Selama Perang Diponegoro, Belanda mengalami kesulitan besar untuk menangkap Diponegoro karena dukungan rakyat dan taktik gerilyanya. Sebagai upaya terakhir, Jenderal de Kock mengumumkan hadiah sebesar 20.000 gulden bagi siapa pun yang dapat menangkap Diponegoro. Langkah ini menunjukkan betapa pentingnya posisi Diponegoro di mata Belanda dan betapa serius mereka ingin mengakhiri perlawanan tersebut.",
        "clue": "Hadiah terbesar dalam Perang Diponegoro.",
        "kata-kunci": ["hadiah", "20000 gulden", "de kock"]
    },

    {
        "id": "TKS-AC-001",
        "judul-soal": "Ultimatum yang Ditolak",
        "soal": "Di ujung abad ke-19, sebuah kerajaan di ujung barat Nusantara berdiri tegak dengan martabatnya sendiri. Suatu hari, seorang pejabat tinggi Belanda datang membawa ultimatum: kerajaan itu diminta mengakui kedaulatan Belanda atas wilayahnya. Surat itu bukan sekadar teks di atas kertas, tetapi upaya untuk menundukkan sebuah negeri yang sejak lama dikenal tangguh dan mandiri. Jawaban yang diberikan bukan kepatuhan, melainkan penolakan tegas. Hanya dalam hitungan hari, penolakan itu dibalas dengan keputusan besar dari Belanda yang kelak mengubah seluruh perjalanan sejarah di sana. Kejadian apa yang dimaksud?",
        "kunci-jawaban": "Deklarasi perang Belanda terhadap Aceh pada 28 Maret 1873.",
        "penjelasan": "Belanda mengirim ultimatum kepada Kesultanan Aceh agar mengakui kedaulatan Belanda. Penolakan Aceh terhadap ultimatum tersebut kemudian dibalas dengan pernyataan perang resmi pada 28 Maret 1873. Dari sinilah Perang Aceh, salah satu perang terpanjang dan paling sengit melawan Belanda, dimulai.",
        "clue": "Tanda dimulainya Perang Aceh.",
        "kata-kunci": ["deklarasi perang", "belanda", "aceh", "28 maret 1873"]
    },
    {
        "id": "TKS-AC-002",
        "judul-soal": "Pertempuran di Bawah Kubah Emas",
        "soal": "Di tengah kota yang menjadi pusat pemerintahan, berdiri sebuah masjid besar dengan kubah megah yang menjadi kebanggaan rakyat. Saat perang meletus, masjid ini bukan hanya tempat ibadah, tetapi juga simbol kehormatan dan pusat berkumpulnya para pejuang. Ketika pasukan Belanda mencoba merebut kota, mereka pun menjadikan masjid ini salah satu sasaran utama. Pertempuran sengit pecah di halaman masjid; peluru beterbangan, teriakan takbir bersahutan, dan dalam kekacauan itu, seorang jenderal Belanda yang memimpin penyerangan tumbang terkena tembakan. Peristiwa apakah ini?",
        "kunci-jawaban": "Tewasnya Jenderal Kohler di halaman Masjid Raya Kutaraja pada 14 April 1873.",
        "penjelasan": "Dalam agresi militer pertama Belanda ke Aceh, Jenderal Kohler memimpin penyerangan ke Kutaraja dan berupaya merebut Masjid Raya Aceh. Di halaman masjid itulah ia tewas tertembak pada 14 April 1873. Kematian seorang jenderal Belanda di tempat suci tersebut semakin mengobarkan semangat perlawanan rakyat Aceh.",
        "clue": "Jenderal Belanda yang gugur di depan masjid.",
        "kata-kunci": ["kohler", "masjid raya", "kutaraja", "14 april 1873"]
    },
    {
        "id": "TKS-AC-003",
        "judul-soal": "Kabar Dukacita di Tengah Kepungan",
        "soal": "Ketika meriam Belanda menggelegar dan pasukan musuh mengepung dari berbagai arah, rakyat Aceh masih menaruh harapan pada sosok pemimpin tertinggi mereka: sang sultan. Namun di tengah suasana mencekam, wabah penyakit menyelinap ke dalam garis pertahanan. Bukan peluru yang merenggut nyawa sang pemimpin, melainkan kolera yang menyebar di antara mereka. Kabar tentang wafatnya sultan menyebar pelan namun pasti, menambah beban psikologis di tengah situasi perang yang sudah berat. Kejadian apakah ini?",
        "kunci-jawaban": "Wafatnya Sultan Mahmud Syah pada 29 Januari 1874.",
        "penjelasan": "Saat agresi kedua Belanda terhadap Aceh, Sultan Mahmud Syah memimpin perlawanan dari dalam wilayah yang terkepung. Di tengah kondisi yang sulit, wabah kolera merebak dan akhirnya merenggut nyawanya pada 29 Januari 1874. Wafatnya sultan menjadi pukulan berat bagi struktur kepemimpinan formal Aceh, meskipun perlawanan rakyat tetap berlanjut.",
        "clue": "Sultan Aceh yang wafat saat wilayahnya dikepung.",
        "kata-kunci": ["sultan mahmud syah", "wafat", "29 januari 1874"]
    },
    {
        "id": "TKS-AC-004",
        "judul-soal": "Seruan Perang Sabil",
        "soal": "Di sebuah tanah yang tidak pernah benar-benar tunduk, seorang ulama karismatik berdiri di hadapan rakyatnya. Ia tidak membawa senjata, tetapi setiap kata yang keluar dari lisannya terasa lebih tajam dari pedang. Di hadapannya, berkumpul para petani, pemuda, dan orang tua yang sudah lelah melihat kekejaman penjajah. Dengan suara lantang, ia menyerukan bahwa melawan penjajahan bukan hanya soal tanah dan kekuasaan, tetapi juga bagian dari kewajiban suci. Seruan itu menyebar dari kampung ke kampung, mengubah perlawanan biasa menjadi perang yang diyakini sebagai ibadah. Peristiwa apa ini?",
        "kunci-jawaban": "Seruan Perang Sabil oleh Teuku di Tiro Syeh Saman pada 1881.",
        "penjelasan": "Teuku di Tiro Syeh Saman mengobarkan semangat perlawanan rakyat Aceh dengan menyerukan Perang Sabil, yaitu perang suci melawan penjajahan Belanda. Seruan ini mengaitkan perjuangan fisik dengan keyakinan agama, sehingga memperkuat tekad rakyat untuk terus berperang meski situasi sangat berat.",
        "clue": "Seruan jihad yang mengguncang Aceh.",
        "kata-kunci": ["perang sabil", "teuku di tiro", "syeh saman", "1881"]
    },
    {
        "id": "TKS-AC-005",
        "judul-soal": "Pengkhianatan di Atas Kapal",
        "soal": "Nama tokoh ini dikenal licin dan sulit ditebak, bahkan oleh musuhnya sendiri. Suatu ketika, ia tampak seolah telah berpihak pada Belanda, menaiki sebuah kapal perang mereka dan dianggap menjadi sekutu yang dapat dipercaya. Namun di tengah perjalanan di laut, ketika kewaspadaan mulai menurun, ia dan orang-orangnya justru berbalik menyerang awak kapal. Senjata-senjata Belanda berhasil dikuasai, dan kapal itu berubah menjadi ajang pembalikan keadaan yang dramatis. Tindakan berani ini semakin mengukuhkan reputasinya sebagai pemimpin yang penuh taktik. Peristiwa apa ini?",
        "kunci-jawaban": "Teuku Umar menyerang awak kapal Bengkoelen dan merampas senjata pada 3 Juli 1884.",
        "penjelasan": "Teuku Umar dikenal menggunakan strategi berpura-pura bekerja sama dengan Belanda untuk mendapatkan keuntungan militer. Pada 3 Juli 1884, ia menaiki kapal Bengkoelen dan kemudian menyerang awak kapal untuk merampas persenjataan mereka. Aksi ini menjadi salah satu contoh paling terkenal dari taktik tipu daya Teuku Umar dalam Perang Aceh.",
        "clue": "Aksi penipuan paling terkenal Teuku Umar.",
        "kata-kunci": ["teuku umar", "kapal bengkoelen", "3 juli 1884"]
    },

    {
        "id": "TKS-AM-001",
        "judul-soal": "Kesepakatan yang Dikhianati",
        "soal": "Setelah Jepang menyerah, sebuah kota kecil di Jawa Tengah menjadi persinggahan pasukan Sekutu yang datang dengan membawa janji. Mereka mengatakan hanya akan datang untuk mengurus tawanan perang dan mengembalikan mereka ke negeri asal. Pada awalnya, rakyat masih mencoba percaya. Namun pelan-pelan, kenyataan pahit terungkap: para tentara Belanda yang tadinya ditawan justru dibebaskan, dipersenjatai kembali, dan mulai bersikap seolah mereka berhak menguasai daerah itu lagi. Janji Sekutu pun tampak seperti kebohongan. Rakyat dan pejuang republik tak tinggal diam ketika mereka merasa dikhianati. Kejadian apa ini?",
        "kunci-jawaban": "Pengkhianatan Sekutu yang mempersenjatai kembali Belanda di Ambarawa.",
        "penjelasan": "Di Ambarawa, Sekutu awalnya datang dengan alasan menjemput dan mengurus tawanan Jepang. Namun kemudian mereka membebaskan tentara Belanda dan mempersenjatai kembali KNIL. Tindakan ini dianggap sebagai pengkhianatan terhadap semangat kemerdekaan Indonesia dan menjadi pemicu utama meletusnya pertempuran di Ambarawa.",
        "clue": "Awal terjadinya pertempuran Ambarawa.",
        "kata-kunci": ["sekutu", "knil", "ambarawa"]
    },
    {
        "id": "TKS-AM-002",
        "judul-soal": "Benteng yang Direbut Kembali",
        "soal": "Di sekitar Ambarawa, sebuah benteng berdiri sebagai titik strategis yang mengawasi jalur penting keluar-masuk kota. Selama Sekutu dan Belanda bercokol di sana, benteng itu menjadi simbol kekuatan mereka. Para pejuang republik menyadari bahwa selama benteng itu masih dikuasai musuh, posisi mereka akan selalu terancam. Maka disusunlah serangan sengit, dari tembakan jarak jauh hingga pertempuran jarak dekat. Setelah perlawanan keras, bendera lawan akhirnya diturunkan dan diganti dengan lambang republik. Peristiwa apakah ini?",
        "kunci-jawaban": "Perebutan benteng sekitar Ambarawa oleh pasukan RI.",
        "penjelasan": "Dalam rangkaian Palagan Ambarawa, pasukan Republik Indonesia berhasil merebut kembali benteng-benteng strategis di sekitar Ambarawa, seperti di kawasan Jatingaleh dan Kedungjati. Keberhasilan ini mempersempit ruang gerak Sekutu dan Belanda, serta membuka jalan bagi pengepungan yang lebih besar terhadap Ambarawa.",
        "clue": "Kemenangan awal sebelum pengepungan Ambarawa.",
        "kata-kunci": ["benteng", "ambarawa", "jatingaleh", "kedungjati"]
    },
    {
        "id": "TKS-AM-003",
        "judul-soal": "Pagar Betis Rakyat",
        "soal": "Dalam sebuah perang, tidak hanya tentara berseragam yang menentukan jalannya sejarah. Di Ambarawa, ribuan warga desa—mulai dari petani, pemuda, hingga orang tua—ikut turun tangan. Mereka tidak membawa senjata lengkap, namun mereka memiliki tekad yang sama: tidak membiarkan musuh dengan mudah kabur dari medan pertempuran. Atas komando para pemimpin, mereka membentuk barisan rapat di jalur-jalur yang mungkin dilalui musuh untuk mundur, bagaikan pagar hidup yang mengepung dari segala arah. Taktik sederhana namun berani ini membuat pasukan Sekutu semakin terjepit. Kejadian apakah ini?",
        "kunci-jawaban": "Taktik pagar betis rakyat Ambarawa.",
        "penjelasan": "Dalam Palagan Ambarawa, rakyat setempat turut membantu TKR dengan membentuk pagar betis, yaitu barisan manusia yang menutup jalan-jalan keluar yang mungkin digunakan pasukan Sekutu dan Belanda untuk mundur. Taktik ini memudahkan pasukan republik untuk mengepung musuh dan mengurangi ruang gerak mereka.",
        "clue": "Strategi rakyat yang membuat Sekutu terjebak.",
        "kata-kunci": ["pagar betis", "rakyat", "ambarawa"]
    },
    {
        "id": "TKS-AM-004",
        "judul-soal": "Serangan Fajar dari Empat Penjuru",
        "soal": "Kabut pagi masih turun tebal di perbukitan sekitar Ambarawa ketika pasukan republik mulai bergerak. Mereka tidak menyerang dari satu arah, melainkan dari berbagai titik ketinggian yang telah dipetakan sebelumnya. Dari lereng bukit dan posisi strategis lain, mortir dan senapan ditembakkan ke arah kedudukan Sekutu. Serangan yang datang dari empat penjuru sekaligus ini membuat musuh terkejut dan kesulitan membalas dengan terarah. Perlahan namun pasti, posisi mereka dipaksa mundur. Peristiwa apakah yang digambarkan dalam kisah ini?",
        "kunci-jawaban": "Serangan serentak TKR dari bukit sekitar Ambarawa.",
        "penjelasan": "Di bawah pimpinan Kolonel Sudirman, pasukan TKR melancarkan serangan fajar dari berbagai titik ketinggian di sekitar Ambarawa. Serangan serentak dari bukit-bukit tersebut membuat posisi Sekutu goyah dan menjadi salah satu kunci kemenangan Republik Indonesia dalam Palagan Ambarawa.",
        "clue": "Serangan dari ketinggian yang menentukan kemenangan.",
        "kata-kunci": ["serangan fajar", "tkr", "bukit", "ambarawa"]
    },
    {
        "id": "TKS-AM-005",
        "judul-soal": "Jenderal Muda Mengubah Jalannya Perang",
        "soal": "Di tengah hiruk pikuk tembakan dan strategi yang terus berubah, muncul sosok pemimpin muda yang belum lama diangkat sebagai perwira tinggi. Usianya baru tiga puluh empat tahun, namun wibawanya mampu membuat pasukan percaya bahwa mereka bisa menang. Ia tidak hanya memerintah dari jauh, melainkan turun langsung ke medan pertempuran, memantau garis depan, dan mengatur pengepungan yang ketat terhadap kedudukan Sekutu. Dengan perhitungan cermat, ia memutus jalur logistik musuh dan memaksa mereka menarik diri dari Ambarawa menuju Semarang. Siapakah tokoh dan peristiwa yang tersirat dalam cerita ini?",
        "kunci-jawaban": "Kolonel Sudirman dalam kemenangan Palagan Ambarawa.",
        "penjelasan": "Kolonel Sudirman, yang saat itu masih berusia 34 tahun, memimpin langsung operasi militer di Ambarawa. Strategi pengepungan dan pemutusan jalur logistik yang ia terapkan berhasil memaksa Sekutu mundur dari Ambarawa. Kemenangan ini kemudian dikenal sebagai Palagan Ambarawa dan menjadi salah satu bukti kepiawaiannya sebagai pemimpin militer.",
        "clue": "Tokoh yang kelak menjadi Panglima Besar.",
        "kata-kunci": ["kolonel sudirman", "palagan ambarawa", "pengepungan"]
    },

    {
        "id": "TKS-SU-001",
        "judul-soal": "Sunyi Sebelum Fajar",
        "soal": "Malam hampir berganti pagi ketika sekelompok pasukan republik menyelinap masuk ke kota yang telah lama dikuasai Belanda. Mereka berjalan dalam senyap, memanfaatkan gelap dan sudut-sudut sempit jalanan untuk menghindari patroli musuh. Di balik tembok, di parit-parit, dan di sudut bangunan, mereka berlindung sambil menunggu satu hal: komando untuk menyerang. Kota yang tampak tenang itu sebenarnya sudah dipenuhi para pejuang yang siap mengubah hari biasa menjadi hari yang akan tercatat dalam sejarah. Peristiwa apakah yang sedang dipersiapkan?",
        "kunci-jawaban": "Persiapan Serangan Umum 1 Maret 1949.",
        "penjelasan": "Menjelang Serangan Umum 1 Maret 1949, pasukan Republik Indonesia secara diam-diam memasuki Yogyakarta dan menempati posisi-posisi strategis tanpa diketahui sepenuhnya oleh Belanda. Persiapan rahasia ini memungkinkan serangan dilakukan secara serentak pada pagi hari dan menjadi faktor penting keberhasilan operasi tersebut.",
        "clue": "Tahap sebelum Yogyakarta direbut 6 jam.",
        "kata-kunci": ["persiapan", "serangan umum 1 maret", "yogyakarta"]
    },
    {
        "id": "TKS-SU-002",
        "judul-soal": "Kota yang Mendadak Berguncang",
        "soal": "Ketika matahari mulai muncul di ufuk timur, Yogyakarta tampak seperti kota biasa di bawah pendudukan. Namun beberapa saat kemudian, suasana itu pecah. Dari berbagai sudut kota—dari arah utara, selatan, timur, dan barat—suara tembakan terdengar serempak. Pasukan republik keluar dari tempat persembunyian dan menyerbu pos-pos Belanda. Bendera merah putih kembali dikibarkan di beberapa titik penting. Selama beberapa jam, kota yang sebelumnya diklaim sudah sepenuhnya dikuasai Belanda justru berada di bawah kendali para pejuang republik. Apa nama peristiwa bersejarah ini?",
        "kunci-jawaban": "Serangan Umum 1 Maret 1949.",
        "penjelasan": "Serangan Umum 1 Maret 1949 adalah operasi militer yang dilancarkan pasukan Republik Indonesia untuk merebut Yogyakarta dari tangan Belanda. Selama sekitar enam jam, pasukan RI berhasil menguasai kota dan menunjukkan kepada dunia bahwa Republik Indonesia masih memiliki kekuatan militer yang terorganisir.",
        "clue": "Serangan yang disiapkan oleh Letkol Soeharto.",
        "kata-kunci": ["serangan umum 1 maret", "1949", "yogyakarta", "6 jam"]
    },
    {
        "id": "TKS-SU-003",
        "judul-soal": "Kabar dari Pedalaman",
        "soal": "Jauh dari hiruk pikuk kota, di tengah hutan dan pegunungan, seorang panglima besar republik menjalani perang gerilya bersama pasukannya. Ia tidak berada di ibu kota, tetapi semangatnya tetap tertambat pada nasib republik. Suatu hari, utusan datang membawa kabar yang sangat dinantikan: Yogyakarta, meski hanya untuk beberapa jam, berhasil direbut kembali oleh pasukan republik. Kabar ini bukan sekadar laporan militer, tetapi juga bukti bahwa perjuangan yang mereka jalani di pedalaman tidak sia-sia. Kabar apakah ini?",
        "kunci-jawaban": "Kabar keberhasilan disampaikan kepada Jenderal Soedirman.",
        "penjelasan": "Setelah Serangan Umum 1 Maret berhasil menguasai Yogyakarta selama beberapa jam, berita mengenai keberhasilan operasi itu dikirimkan kepada Jenderal Soedirman yang sedang bergerilya. Informasi tersebut menguatkan moral pimpinan dan pasukan Republik bahwa perjuangan bersenjata masih memberikan hasil nyata.",
        "clue": "Pesan penting bagi Panglima Besar.",
        "kata-kunci": ["kabar keberhasilan", "jenderal soedirman", "gerilya"]
    },
    {
        "id": "TKS-SU-004",
        "judul-soal": "Radio yang Menggema ke Dunia",
        "soal": "Di sebuah lokasi tersembunyi, jauh dari pantauan Belanda, sebuah pemancar radio tua kembali dinyalakan. Seorang penyiar republik duduk di depan mikrofon dengan naskah singkat di tangannya. Suaranya mungkin tidak terdengar di medan pertempuran, tetapi gelombang radio yang ia pancarkan melintas jauuuh melampaui batas kota. Lewat siaran itu, ia mengabarkan kepada pendengar di berbagai penjuru bahwa pasukan Indonesia baru saja berhasil merebut kembali ibu kota republik untuk beberapa waktu. Siaran ini menjadi bukti bahwa perjuangan belum padam. Peristiwa apakah ini?",
        "kunci-jawaban": "Siaran radio Serangan Umum 1 Maret.",
        "penjelasan": "Radio AURI (Angkatan Udara Republik Indonesia) menyiarkan berita keberhasilan Serangan Umum 1 Maret 1949 ke dunia luar. Siaran ini bertujuan menunjukkan bahwa Republik Indonesia masih eksis dan melakukan perlawanan aktif, sekaligus membantah klaim Belanda bahwa republik telah hancur.",
        "clue": "Bukti perjuangan RI yang didengar seluruh dunia.",
        "kata-kunci": ["radio auri", "siaran", "serangan umum 1 maret"]
    },
    {
        "id": "TKS-SU-005",
        "judul-soal": "Siasat yang Mengubah Dunia",
        "soal": "Jika dilihat sepintas, serangan yang hanya merebut kota selama beberapa jam mungkin tampak seperti kemenangan kecil. Namun para pemimpin republik melihatnya dengan cara yang berbeda. Mereka tahu bahwa dunia internasional sedang memperhatikan klaim Belanda yang mengatakan bahwa Republik Indonesia sudah tidak lagi memiliki kekuatan. Dengan merencanakan serangan besar yang bisa menunjukkan bahwa pasukan RI masih mampu menguasai ibu kota, mereka sebenarnya sedang mengirim pesan politik yang kuat ke luar negeri. Serangan itu menjadi alat untuk membuka mata dunia bahwa republik masih hidup dan layak diakui. Peristiwa apakah yang dimaksud dengan siasat ini?",
        "kunci-jawaban": "Tujuan politis Serangan Umum 1 Maret.",
        "penjelasan": "Serangan Umum 1 Maret 1949 tidak hanya dirancang sebagai operasi militer, tetapi juga sebagai strategi diplomatik. Dengan menguasai Yogyakarta selama beberapa jam dan kemudian menyiarkan keberhasilannya, Republik Indonesia ingin menunjukkan kepada dunia internasional bahwa klaim Belanda tentang berakhirnya republik adalah salah. Hal ini memperkuat posisi Indonesia dalam diplomasi dan tekanan internasional terhadap Belanda.",
        "clue": "Tujuan diplomatik terbesar dari serangan.",
        "kata-kunci": ["tujuan politis", "serangan umum 1 maret", "eksistensi ri"]
    }
]
